void	ft_print_comb(void)
{
	char	a;
	char	b;
	char	c;

	a = '0'; 
	while (a <= '7')
	{
		; // b ديما كبر من a بـ 1
		while = (b <= '8')
		{
			c = b + 1; // c ديما كبر من b بـ 1
			while (c <= '9')
			{
				// هنا كنطبعو الخانات بثلاثة
				write(1, &a, 1);
				write(1, &b, 1);
				write(1, &c, 1);

				// شرط الفاصلة: يلا وصلنا لـ 789 مخصناش نزيدو فاصلة ealamt ta3ajob kt3ni not
				if (!(a == '7' && b == '8' && c == '9'))
				{
					write(1, ", ", 2);
				}
				c++; // كنزيدو ف الخانة الثالثة
			}
			b++; // ملي كتسالي c الدورة ديالها، كنزيدو ف b
		}
		a++; // ملي كتسالي b الدورة ديالها، كنزيدو ف a
	}
}